# Creación y conexión a la base de datos

El proposito de este notebook es guiar la practica que se ejecutará a travez de Workbench.

In [ ]:
# Tener descargado MySQL Server
# https://dev.mysql.com/downloads/mysql/

# Tener descargado MySQL Workbench
# https://www.mysql.com/products/workbench/

Nos conectamos a la instancia local en este caso "Local instance MySQL80"

![img1](https://drive.google.com/uc?export=view&id=1T-O2xCB1rBb1t__Y_k6SnTpTpbxmLaA4)

## Nuevo modelo

Para crear un nuevo modelo, hagamos lo siguiente:
1. Clic al icono de crear un nuevo esquema
2. En la pestaña, guardar el modelo con el nombre de lessons.

**Nota:** presionar Apply.

![img3](https://drive.google.com/uc?export=view&id=1H61bRZo6KRpBFFtzc7UjRlA3UbVOLEPf)

## Construyendo mi base de datos: Usuarios y comentarios

3. Ahora, es momento de crear la primer tabla. Haz clic derecho en la BD y selecciona la opcion de **Create Table**.
4. En el campo de Table Name escirbe User
5. Da clic a la opcion de **Apply**

![img4](https://drive.google.com/uc?export=view&id=13pA_eS5t9-ZQ0UD_fnE9zJWGZcDOcFCz)

6. La tabla "User" llevará los siguientes campos:
- email como PK
- first_name tipo texto
- last_name tipo texto
- address tipo texto
- age tipo integer

![img6](https://drive.google.com/uc?export=view&id=1jdaujU9G2ixy9PgfdUuXlzvSv1u4Wrau)

También puedes lograr crear la tabla con un consulta SQL directa como la siguiente:

```
CREATE TABLE IF NOT EXISTS 
User(
  email varchar(45), 
  first_name varchar(45), 
  last_name varchar(45), 
  address varchar(45), 
  age int, 
  PRIMARY KEY (email)
)
```

## Insertar datos en nuestra tabla User

*texto en cursiva*

```
INSERT INTO user VALUES ('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasy City', 'de')
INSERT INTO user VALUES ('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasy City', 39)
```

## Seleccionamos datos de nuestra tabla User

```
# Seleccionamos todos los registros de nuestra tabla
SELECT * FROM user

# Seleccionamos únicamente un par de columnas pero todas las filas (sin filtro)
SELECT email, first_name FROM user
SELECT first_name, last_name FROM user

# ¿Que pasaría si seleccionamos una columna que no existe?
SELECT email, gender FROM user
```

### Selección de datos con WHERE

```
# Selecciona todas las columnas pero solo a las personas cuya edad sea igual a 39
SELECT * FROM user WHERE age = 39
```

### Ordenando filas en la selección

```
# Seleccionamos email y edad, ordenando por edad en orden descendente
SELECT email, age FROM user ORDER BY age DESC
```

### Actualizando nuestra tabla: nuevo campo

```
# Añadimos un campo gender a la tabla
ALTER TABLE user ADD COLUMN gender text
```

### Actualizando nuestra tabla: cambios en los registros

```
# Establecemos gende como M para todos los usuarios
UPDATE user SET gender='M'
# Vamos a revisar el resultado
SELECT email, gender FROM user

# Vamos a actualizar la edad de nuestro usuario bob@example.com
UPDATE user SET age=38 WHERE user.email='bob@example.com'
# Validamos el resultado
SELECT email, gender, age FROM user ORDER BY age DESC

# Finalmente, podemos actualizar insertando un nuevo registro. Hagamos lo siguiente:
INSERT INTO user VALUES('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')
# Ahora veamos la lista de todos nuestros usuarios
SELECT * FROM user
```